# Reading & Writing Files in Pandas

Pandas makes it easy to **read and write data** from multiple file formats like **CSV**, **Excel**, and **JSON** ‚Äî the most common ones in data science projects.

---

## üìÇ Reading & Writing CSV Files

### üßæ Read CSV

```python
import pandas as pd

df = pd.read_csv("data.csv")
```

### ‚öôÔ∏è Common Options

```python
pd.read_csv("data.csv", usecols=["Name", "Age"], nrows=10)
```
- `usecols` ‚Üí Select specific columns to read.  
- `nrows` ‚Üí Read only the first N rows.

---

### üíæ Write CSV

```python
df.to_csv("output.csv", index=False)
```
‚úÖ `index=False` ensures the DataFrame index is **not written** to the file.

---

## üìò Reading & Writing Excel Files

### üßæ Read Excel

```python
df = pd.read_excel("data.xlsx")
```

### ‚öôÔ∏è Common Options

```python
pd.read_excel("data.xlsx", sheet_name="Sales")
```
- `sheet_name` ‚Üí Specify which sheet to read from an Excel file.

---

### üíæ Write Excel

```python
df.to_excel("output.xlsx", index=False)
```

### ‚ú® Writing to Multiple Sheets

You can write **multiple DataFrames** to different sheets in the same Excel file:

```python
with pd.ExcelWriter("report.xlsx") as writer:
    df1.to_excel(writer, sheet_name="Summary", index=False)
    df2.to_excel(writer, sheet_name="Details", index=False)
```

üìò **Tip:** You can install `openpyxl` if you encounter issues:
```bash
pip install openpyxl
```

---

## üåê Reading & Writing JSON Files

### üßæ Read JSON

```python
df = pd.read_json("data.json")
```

### üíæ Write JSON

```python
df.to_json("output.json", orient="records", lines=True)
```

Options like `orient="records"` and `lines=True` help format JSON for APIs or NDJSON-style storage.

---

## ‚úÖ Summary

| File Type | Read Function | Write Function | Notes |
|------------|----------------|----------------|--------|
| **CSV** | `pd.read_csv()` | `df.to_csv()` | Most common format for tabular data |
| **Excel** | `pd.read_excel()` | `df.to_excel()` | Use `sheet_name` for specific sheets |
| **JSON** | `pd.read_json()` | `df.to_json()` | Useful for web data and APIs |

---

### üí° Key Takeaways

- Use `read_*` methods (like `read_csv`, `read_excel`, `read_json`) to **import** data.  
- Use `to_*` methods (like `to_csv`, `to_excel`, `to_json`) to **export** data.  
- Pandas automatically detects file structure and formats for seamless I/O operations.

---

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('data2.csv')
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com    1/5/2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12/11/2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com    1/5/2021
7    Alice  25.0     New York      F  alice@example.com    1/5/2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [7]:
df = df[df['Age']>22]
df

  Name   Age         City Gender            Email   Join Date
2  Bob  30.0  Los Angeles      M  bob@example.com  15-06-2020
5  NaN  28.0        Delhi      F   eve@domain.com         NaN

In [9]:
# Writing CSV / index = False means drop index

df.to_csv('updated.csv')                      # Create a new csv file

In [10]:
data = [
    {"id": 1, "name": "Alice", "address": {"city": "Delhi", "zipcode": "110001"}},
    {"id": 2, "name": "Bob", "address": {"city": "Mumbai", "zipcode": "400001"}}
]

In [13]:
pd.DataFrame(data)                              # U can see that its complax data

   id   name                                  address
0   1  Alice   {'city': 'Delhi', 'zipcode': '110001'}
1   2    Bob  {'city': 'Mumbai', 'zipcode': '400001'}

In [14]:
dff = pd.json_normalize(data)
dff                                         # Normalized the Json Data

   id   name address.city address.zipcode
0   1  Alice        Delhi          110001
1   2    Bob       Mumbai          400001